<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Practice Notebook: Data Cleaning with Python - Missing Data

## 5. Missing Data

#### <font color="blue">Pre-requisites</font>

In [ ]:
# Pre-requisite
# ---
# Importing pandas library
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# Finding records with missing data
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

# Loading our dataset
# ---
# 
df = pd.read_csv('http://bit.ly/SampleDataset') 

# Previewing our dataset
# ---
# 
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [ ]:
# We can check if there is any missing values in the entire dataframe as shown
# Let's uncomment the following line
# NB: This method may not be the most convenient. Why?
# ---
# 
df.isnull()

# We can also check for missing values in each column 
# NB: This method may not be the most convenient. Why?
# Let's uncomment the following line
# ---
# 
df.isnull().any()

# We can check how many missing values there are across each variable/column by
# Let's uncomment the following line
# ---
# 
df.isnull().sum()

# We can also check to see if we have any missing values in the dataframe by
# Let's uncomment the following line
# ---
# 
df.isnull().values.any()

# Lastly, We can also get a total count of missing values by
# Let's uncomment the following line
#
# ---
df.isnull().sum().sum()

2

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# Dealing with the missing data
# ---
# 

# We can drop rows where all cells in that row is NA
# Let's uncomment the following line
# NB: We don't have these rows in our dataset 
# ---
#
df_cleaned = df.dropna(how='all')
df_cleaned

In [ ]:
# We can also drop columns if they only contain missing values
# Let's uncomment the following line
# NB: We don't have these rows in our dataset 
# ---
# 
df_without_columns = df.dropna(axis=1, how='all')
df_without_columns

                NAME               CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

In [ ]:
# We can drop rows that contain less than five observations
# NB: We don't have these rows in our dataset 
# ---
# 
df.dropna(thresh=5)

                NAME               CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

In [ ]:
# We can also fill in missing data with zeros
# Let's uncomment the following line 
# ---
# 
df2 = df.copy()
df3 = df2.fillna(0)
df3

                NAME               CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

In [ ]:
# Lastly, we can also drop the missing observations
# Let's uncomment the following two lines
# ---
#
df_no_missing = df.dropna()
df_no_missing


# There are many methods of dealing with missing data however, 
# we only dealt with the above basic ones due to time constraints.

                NAME               CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949

[6 rows x 8 columns]

##### <font color="blue">Example 3</font>

In [ ]:
# Example 3
# ---
# Flag missing values
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# 

# We can also fill in missing data with zeros as shown.
# NB: We will create a copy of the original dataframe
# Let's uncomment the following line 
# ---
# 
df2 = df.copy()
df3 = df2.fillna(0)
df3

                NAME               CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [ ]:
# Challenge 1
# ---
# Question: Find missing values in the following dataset.
# ---
# Dataset url = http://bit.ly/DCTitanicDataset
# ---
# 

# Checking how many missing values there are across each variable
# ---
# 
titanic_df = pd.read_csv('http://bit.ly/DCTitanicDataset')
titanic_df.head()

   pclass  survived  ...   body                        home.dest
0     1.0       1.0  ...    NaN                     St Louis, MO
1     1.0       1.0  ...    NaN  Montreal, PQ / Chesterville, ON
2     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
3     1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [ ]:
# Determining the size of our dataset
# ---
#
titanic_df.shape

(1310, 14)

In [ ]:
# Checking how many missing values there are across each variable
# ---
# 
titanic_df.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

##### <font color="green">Challenge 2</font>

In [ ]:
# Challenge 2
# ---
# Question: Deal with the missing values found in the above dataset.  
# ---
# 


# We can decide to drop the variables many missing values
# ---
# 
titanic_df.drop(["cabin", "boat", "body", "home.dest"], axis = 1, inplace = True) 

# Checking how many missing values there are across each variable
# ---
# 
titanic_df.isnull().sum()

pclass        1
survived      1
name          1
sex           1
age         264
sibsp         1
parch         1
ticket        1
fare          2
embarked      3
dtype: int64